#pragma once
#include <iostream>
#include <iomanip>
#include <Windows.h>
using namespace std;

extern vector<Teacher> myTeachers;

extern vector<Student> myStudents;

void printMainMenu()
{
	system("cls");
	cout << right
		<< endl
		<< setw(24) << "过程考核系统" << endl
		<< "------------------------------------" << endl
		<< setw(22) << "欢迎使用" << endl
		<< "------------------------------------" << endl << endl
		<< "          ┌────────┐" << endl
		<< "       ID:│                │" << endl
		<< "          └────────┘" << endl
		<< "          ┌────────┐" << endl
		<< " PASSWORD:│                │" << endl
		<< "          └────────┘" << endl << endl
		<< "  ①管理员    "<<"②教师    "<<"③学生" << endl << endl
		<< setw(20) << "④退出" << endl << endl
		<< "------------------------------------" << endl
		<< "请输入您的选择（1/2/3/4）：";
}

void printExit()
{
	system("cls");
	for (int i = 5; i >= 0; i--)
	{
		cout << right
			<< endl
			<< setw(24) << "过程考核系统" << endl
			<< "------------------------------------" << endl
			<< setw(22) << "欢迎使用" << endl
			<< "------------------------------------" << endl << endl
			<< setw(4) << " " << "┌────────────┐" << endl
			<< setw(4) << " " << "│ 感谢支持！（" << i << "秒后退出）│" << endl
			<< setw(4) << " " << "└────────────┘" << endl << endl
			<< "------------------------------------" << endl
			<< "请输入您的选择（1/2/3/4）：1";
		Sleep(1000);
		system("cls");
	}
}

void printAdminMenu()
{
	system("cls");
	cout << right
		<< endl
		<< setw(28) << "过程考核系统 1-1" << endl
		<< "------------------------------------" << endl
		<< setw(28) << "欢迎您，admin 管理员" << endl
		<< "------------------------------------" << endl
		<< setw(12) << " " << "1.课程管理" << endl
		<< setw(12) << " " << "2.教师管理" << endl
		<< setw(12) << " " << "3.学生管理" << endl
		<< setw(12) << " " << "4.返回上级菜单" << endl
		<< "------------------------------------" << endl
		<< "请输入您的选择（1/2/3/4）：";
}

void printCourseManagementMenu()
{
	system("cls");
	cout << right
		<< endl
		<< setw(30) << "过程考核系统 1-1-1 " << endl
		<< "------------------------------------" << endl
		<< setw(12) << " " << "课程信息管理" << endl
		<< "------------------------------------" << endl
		<< setw(12) << " " << "1.添加课程" << endl
		<< setw(12) << " " << "2.删除课程" << endl
		<< setw(12) << " " << "3.修改课程信息" << endl
		<< setw(12) << " " << "4.列出所有课程信息" << endl
		<< setw(12) << " " << "5.返回上级菜单" << endl
		<< "------------------------------------" << endl
		<< "请输入您的选择（1/2/3/4/5）：";
}

void printTeacherManagementMenu()
{
	system("cls");
	cout << right
		<< endl
		<< setw(30) << "过程考核系统 1-1-2 " << endl
		<< "------------------------------------" << endl
		<< setw(12) << " " << "教师信息管理" << endl
		<< "------------------------------------" << endl
		<< setw(12) << " " << "1.增加教师" << endl
		<< setw(12) << " " << "2.删除教师" << endl
		<< setw(12) << " " << "3.查找教师" << endl
		<< setw(12) << " " << "4.修改教师信息" << endl
		<< setw(12) << " " << "5.列出所有教师信息" << endl
		<< setw(12) << " " << "6.返回上级菜单" << endl
		<< "------------------------------------" << endl
		<< "请输入您的选择（1/2/3/4/5/6）：";
}

void printStudentManagementMenu()
{
	std::system("cls");
	cout << right
		<< endl
		<< setw(30) << "过程考核系统 1-1-3 " << endl
		<< "------------------------------------" << endl
		<< setw(12) << " " << "学生信息管理" << endl
		<< "------------------------------------" << endl
		<< setw(12) << " " << "1.增加学生" << endl
		<< setw(12) << " " << "2.删除学生" << endl
		<< setw(12) << " " << "3.查找学生" << endl
		<< setw(12) << " " << "4.修改学生信息" << endl
		<< setw(12) << " " << "5.列出所有学生信息" << endl
		<< setw(12) << " " << "6.返回上级菜单" << endl
		<< "------------------------------------" << endl
		<< "请输入您的选择（1/2/3/4/5/6）：";
}

void printStudentMenu(int i)
{
	std::system("cls");
	cout << right
		<< endl
		<< setw(28) << "过程考核系统 1-3" << endl
		<< "------------------------------------" << endl
		<< setw(18) << "欢迎您，" << myStudents[i].getName() << " 同学" << endl           //学生姓名
		<< "------------------------------------" << endl
		<< setw(12) << " " << "1.查看课程表" << endl
		<< setw(12) << " " << "2.选课" << endl
		<< setw(12) << " " << "3.查看成绩单" << endl
		<< setw(12) << " " << "4.修改登录密码" << endl
		<< setw(12) << " " << "5.返回上级菜单" << endl
		<< "------------------------------------" << endl
		<< "请输入您的选择（1/2/3/4）：";
}

void printTeacherMenu(int i)
{
	std::system("cls");
	cout << right
		<< endl
		<< setw(28) << "过程考核系统 1-2" << endl
		<< "------------------------------------" << endl
		<< setw(18) << "欢迎您，"<<myTeachers[i].getName()<<" 老师" << endl           //老师姓名
		<< "------------------------------------" << endl
		<< setw(12) << " " << "1.课程考核" << endl
		<< setw(12) << " " << "2.修改考核标准" << endl
		<< setw(12) << " " << "3.列出授课信息" << endl
		<< setw(12) << " " << "4.修改登录密码" << endl
		<< setw(12) << " " << "5.返回上级菜单" << endl
		<< "------------------------------------" << endl
		<< "请输入您的选择（1/2/3/4）：";
}

void printTeacherModifyCourseCheck()
{
	std::system("cls");
	cout << right
		<< endl
		<< setw(28) << "过程考核系统 1-2-2" << endl
		<< "------------------------------------" << endl
		<< setw(12) << " " << "修改考核标准" << endl              
		<< "------------------------------------" << endl
		<< setw(12) << " " << "1.查看现有标准" << endl
		<< setw(12) << " " << "2.增加考核项目" << endl
		<< setw(12) << " " << "3.删除考核项目" << endl
		<< setw(12) << " " << "4.修改考核比例" << endl
		<< setw(12) << " " << "5.返回上级菜单" << endl
		<< "------------------------------------" << endl
		<< "请输入您的选择（1/2/3/4/5）：";
}

void printStudentInfo(Student &stu)
{
	cout << left
		<< endl
		<< setw(20) <<" "<< "成绩单" << endl
		<< "==========================================================" << endl
		<< "姓名：" << setw(8) << stu.getName() << "班级：" << setw(8) << stu.getStuClass() << "学号：" << setw(8) << stu.getStuNum() << endl      //具体姓名班级学号
		<< "==========================================================" << endl;
	stu.showAllCoursesScore();
	cout << "==========================================================" << endl;
}
